create_clock -period 10.000 -name clk -waveform {0.000 5.000} [get_ports clk]
#set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {op1_i[*]}]
#set_input_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports {op1_i[*]}]
#set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {op2_i[*]}]
#set_input_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports {op2_i[*]}]
#set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {opcode_i[*]}]
#set_input_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports {opcode_i[*]}]
#set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports flush_i]
#set_input_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports flush_i]
#set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports padv_i]
#set_input_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports padv_i]
#set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports rndMode_i]
#set_input_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports rndMode_i]
#set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports rst]
#set_input_delay -clock [get_clocks clk] -max -add_delay 3.000 [get_ports rst]
#set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {result_o[*]}]
#set_output_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {result_o[*]}]
#set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports isReady_o]
#set_output_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports isReady_o]
#set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports isResultValid_o]
#set_output_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports isResultValid_o]
